# RelinquishOptions Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RelinquishOptions Properties
RelinquishOptions Class See Also
---
The RelinquishOptions type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CheckedOutElements | True means all elements checked out by the current user should be relinquished. False means none of these are relinquished. |
| FamilyWorksets | True means all family worksets owned by the current user should be relinquished. False means none of these are relinquished. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| StandardWorksets | True means all project standards worksets owned by the current user should be relinquished. False means none of these are relinquished. |
| UserWorksets | True means all user-created worksets owned by the current user should be relinquished. False means none of these are relinquished. |
| ViewWorksets | True means all view worksets owned by the current user should be relinquished. False means none of these are relinquished. |

# See Also
RelinquishOptions Class
Autodesk.Revit.DB Namespace